Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: རབ་ཏུ་འཁྲུགས། ལྡེག །རབ་ཏུ་ལྡེག་གོ། །སིལ་སྙན་དག་ཀྱང་མ་དཀྲོལ་བར་སྒྲ་འཁྲོལ་ལོ།
en: There was the sound of music without any musical instruments being played.

source: །རི་དགས་དང་། བྱ་གག་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འཇམ་ཞིང་ཡིད་དུ་འོང་བའི་སྒྲ་སྒྲོགས་སོ། །ཤིང་ལྗོན་པ་དག་ལས་ཀྱང་མེ་ཏོག་དག་འབྲུལ་ལོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སེམས་ཅན་དམྱལ་བ་པ་རྣམས་དང་།
en: All the animals and birds made beautiful and gentle sounds, and the trees emitted flowers.

source: གཤིན་རྗེའི་འཇིག་རྟེན་པ་རྣམས་མ་གཏོགས་པར་གང་སུ་དག་ས་ལ་རྟེན་ཅིང་གནས་པའི་འབྱུང་པོ་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་མ་བཅུག་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕན་པའི་སེམས་དང་། དགེ་བའི་སེམས་དང་། ཁོན་མེད་པའི་སེམས་དང་། རྙོག་པ་མེད་པའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། ངོ་མཚར་གྱི་སེམས་དག་ཏུ་གྱུར་ཏོ།
en: All the beings who dwelt and lived upon the earth in the worlds of the billion-world universe, whether they aspired to enlightenment or not—except for beings in the hells and in the world of Yama—developed altruistic minds, good minds, minds without enmity, minds that are not impure, loving minds, and amazed minds.

source: །སེམས་ཅན་གང་དག་ནམ་མཁའ་ལ་རྒྱུ་བ་དེ་དག་ཀྱང་བྲམ་ཟེའི་སྨོན་ལམ་སྒྲ་འཇམ་ཞིང་ཡིད་དུ་འོང་བ་མཉན་པའི་ཕྱིར་ནམ་མཁའ་ལ་འཁོད་ནས་འདི་ལྟར་མཆོག་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་དང་། སྤོས་དང་། རོལ་མོའི་སྒྲ་དང་། རིན་པོ་ཆེའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། གོས་དང་། རས་བཅོས་བུ་དག་གིས་མཆོད་པའི་ལས་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: Those beings who lived in the sky engaged with rejoicing minds in offering flowers, flower garlands, incense, the sound of music, precious parasols, victory banners, flags, clothing, and cotton so as to listen to the brahmin’s gentle and beautiful prayer.

source: །དེ་བཞིན་དུ་འོག་མིན་གྱི་གནས་མན་ཆད་ཀྱི་ལྷ་གང་ཇི་སྙེད་པ་རྣམས་ཀྱང་། བྲམ་ཟེའི་སྨོན་ལམ་མཉན་པའི་ཕྱིར་འཛམ་བུའི་གླིང་དུ་བབས་ཏེ། ནམ་མཁའི་དཀྱིལ་ན་འཁོད་ཅིང་། ལྷའི་སྤོས་དང་། རས་བཅོས་བུའི་བར་དག་གིས་མཆོད་པའི་ལས་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: Similarly, devas as far up as the Akaniṣṭha paradise descended to Jambudvīpa, stood in the middle of the sky, and engaged in making offerings of divine incense, and so on, up to and including cotton, in order to hear the brahmin’s prayer. “

source: །བྲམ་ཟེས་ཀྱང་ཐལ་མོ་སྦྱར་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །བསམ་གཏན་དག་གིས་རྣམ་གྲོལ་ཚངས་པ་བཞིན།
en: The brahmin placed his palms together and praised the Tathāgata Ratnagarbha with these verses: “ ‘Like Brahmā, you delight in meditations.

source: །གཟུགས་ཀྱིས་འོད་གསལ་བརྒྱ་བྱིན་འདྲ་བ་སྟེ།
en: Like Śakra, your body shines.

source: །རྒྱལ་པོ་བཞིན་དུ་ནོར་འབྲུ་རབ་གཏོང་ཞིང་།
en: Like a king, you give wealth and grain.

source: །རིན་ཆེན་མཆོག་མངའ་ཐུབ་པ་ཚོང་དཔོན་བཞིན།
en: Like a sagacious merchant, you have obtained the supreme jewel. “ ‘

source: །ཞི་བ་སྒྲོགས་མཛད་རི་ལ་སེང་གེ་འདྲ།
en: Like a lion on a mountain, O calm one, you roar.

source: །མི་འགུལ་བརྟན་པ་ལྷུན་པོ་འདྲ་བ་སྟེ།
en: Like Mount Meru, you are firm and unwavering.

source: །རྒྱ་མཚོ་བཞིན་དུ་འཁྲུག་པ་མི་མངའ་ཞིང་།
en: Like the ocean, you are unshaken.

source: །ཡོན་ཏན་སྐྱོན་ལ་ས་བཞིན་མཚུངས་པར་སྤྱོད།
en: Like the earth, you bear the good and bad. “ ‘

source: །དྲི་མ་ཐམས་ཅད་དེད་པ་ཆུ་བཞིན་ཏེ།
en: Like water, you carry away all stains.

source: །ཐུབ་པ་མེ་ལྟར་ཉོན་མོངས་ནགས་རྣམས་སྲེག །
en: Like fire, O Sage, you burn away the forest of kleśas.

source: རླུང་ལྟར་གང་ལའང་ཆགས་པ་མི་མངའ་ཞིང་།
en: Like the wind, you do not attach to anything.

source: །ཐུབ་པ་ལྷ་ལྟར་ཡང་དག་ཉིད་ཀྱང་སྟོན།
en: Like a deva, O Sage, you show the truth. “ ‘

source: །ཀླུ་ལྟར་ཐུབ་པ་ཆོས་ཀྱི་ཆར་འབེབས་ཤིང་།
en: Like a nāga, you bring a rain of Dharma.

source: །ཆར་བ་བཞིན་དུ་འགྲོ་ཀུན་ངོམས་པར་མཛད།
en: Like rain, you bring satisfaction to all beings.

source: །ཕ་རོལ་མུ་སྟེགས་འཇོམས་པ་སེང་གེ་འདྲ།
en: Like a lion, you defeat tīrthika adversaries.

source: །མེ་ཏོག་བཞིན་དུ་ཡོན་ཏན་དྲི་ཡང་གཏོང་།
en: Like a flower, you emit the fragrance of good qualities. “ ‘

source: །ཚངས་པ་བཞིན་དུ་སྙན་པའི་ཚིག་གསུང་ཞིང་།
en: Like Brahmā, you speak with a beautiful voice.

source: །འགྲོ་བ་སྡུག་བསྔལ་གྲོལ་མཛད་སྨན་པ་བཞིན།
en: Like a doctor, you free beings from suffering.

source: །སེམས་མཉམ་ཉེ་བར་གནས་པ་མ་བཞིན་ཏེ།
en: Like a mother, you care for all equally.

source: །འགྲོ་བ་རྟག་ཏུ་རྗེས་འཛིན་མཛའ་བཤེས་འདྲ།
en: Like a friend, you always help beings. “ ‘

source: །ང་རྒྱལ་དགྲ་འཇོམས་རྡོ་རྗེ་བརྟན་བཞིན་ཏེ།
en: Like a vajra, you are firm and destroy the enemy of pride.

source: །ཐུབ་པ་མཚོན་བཞིན་སྲིད་པའི་འཁྲི་ཤིང་གཅོད།
en: Like a weapon, O Sage, you cut through the tendrils of craving.

source: །ཟམ་པའི་ཤིང་བཞིན་འགྲོ་བ་སྒྲོལ་མཛད་ཅིང་།
en: Like a bridge, you take beings across.

source: །ཀླུ་ལྟར་ཐུབ་པ་མི་ཤེས་རྩྭ་རྣམས་བསྲེག །
en: Like a nāga, O Sage, you burn the grass of ignorance. “ ‘

source: ཐུབ་པ་ཟླ་ལྟར་འོད་བསིལ་གཏོང་མཛད་ཅིང་།
en: Like the moon, O Sage, you give cooling light.

source: །མི་ཡི་པད་མ་ཁ་འབྱེད་ཉི་མ་བཞིན།
en: Like the sun, you cause the lotuses that are humans to blossom.

source: །འབྲས་བུ་མཆོག་བཞི་སྦྱིན་མཛད་ལྗོན་ཤིང་འདྲ།
en: Like a tree, you provide the four supreme fruits.

source: །ཐུབ་པ་བྱ་བཞིན་དྲང་སྲོང་ཚོགས་ཀྱིས་བསྐོར།
en: Like a bird, O Sage, you are surrounded by a community of ṛṣis. “ ‘

source: །རྒྱལ་བའི་བློ་ཡངས་རྒྱ་མཚོ་འདྲ་བ་སྟེ།
en: Like the ocean, you have a jina’s vast understanding.

source: །འགྲོ་བ་དག་ལ་སེམས་སྙོམས་རྩྭ་ཤིང་བཞིན།
en: Like trees and grass, you are the same toward all beings.

source: །རྨི་ལམ་བཞིན་དུ་ཆོས་རྣམས་སྟོང་རྟོག་ཅིང་།
en: Like a dream, you perceive all phenomena as empty.

source: །འཇིག་རྟེན་རྗེས་སུ་འཐུན་འཇུག་ཆུ་དང་འདྲ།
en: Like water, you act in harmony with the world. “ ‘

source: །ཐུབ་པ་མཚན་མཆོག་མངའ་བ་ཐུགས་རྗེ་ཅན། །ཁྱོད་ཀྱིས་སེམས་ཅན་བྱང་ཆུབ་ལུང་ཡང་བསྟན། །སེམས་ཅན་མང་པོ་མཐའ་ཡས་ཁྱོད་ཀྱིས་བཏུལ། །བྱང་ཆུབ་མཆོག་རབ་ཏུ་ནི་བདག་ལུང་སྟོན།
en: O Sage, you are a compassionate one, a bearer of the supreme qualities— You who have prophesied enlightenment to beings, You who have trained countless beings, Give me the prophecy of my supreme enlightenment. “ ‘

source: །དྲང་སྲོང་ཆེན་པོ་བདེན་བཞེད་ཤེས་རབ་མཆོག །
en: O great ṛṣi, speak truth, you who have supreme wisdom, Cut through my doubts and prophesy my enlightenment.

source: བདག་ནི་འགྲོ་བའི་ཉོན་མོངས་འཐབ་རྩོད་ཆེ། །སངས་རྒྱས་བྱང་ཆུབ་ལུང་སྟོན་དོགས་ཆོད་ལ།
en: May I be a buddha for beings in strife through the kaliyuga’s kleśas!

source: །སེམས་ཅན་བརྒྱ་དག་ཞི་བདེའི་ལམ་དུ་འཁོད།
en: May I lead hundreds of beings onto the path to peace!’ “

source: །རིགས་ཀྱི་བུ་གང་གི་ཚེ་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ། དེ་ན་འདུག་པའི་དེའི་མོད་ལ་ལྷ་དང་། དྲི་ཟ་དང་། མི་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: Noble son, when the brahmin Samudrareṇu, the principal royal priest, had praised the Tathāgata Ratnagarbha with these verses, the entire assembly with its devas, gandharvas, and humans commended him. “

source: །མདུན་ན་འདོན་གྱིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཏེ།
en: The royal priest said, ‘Bhadanta Bhagavat, I have caused many millions of beings to focus upon the highest, most complete enlightenment.

source: དེ་དག་གིས་ཀྱང་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེ་དགུ་དག་ཡོངས་སུ་བཟུང་ཞིང་འདུལ་བའི་སེམས་ཅན་ཡང་བསམ་པ་ཡོངས་སུ་དག་པ་དང་། དགེ་བའི་རྩ་བ་བསྲུངས་པ་དང་། གདུལ་སླ་བ་དག་ཡོངས་སུ་བཟུང་ལགས་སོ།
en: Each of them has chosen an excellent buddha realm and has chosen well-trained beings with pure motivations who have planted roots of virtue and who are easy to train.

source: །གང་དག་སྐར་མ་སྐྱོང་ལ་སོགས་པ་བྲམ་ཟེའི་ཁྱེའུ་རིག་བྱེད་ཀློག་པ་སྟོང་རྩ་བཞི་པོ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་བཟང་པོར་ལུང་བསྟན་ཏེ།
en: And the Tathāgata has prophesied to these 1,004 young Veda-reciting brahmins, beginning with Jyotipāla, that they will attain enlightenment in the Bhadraka eon.

source: སྐྱེས་བུ་དམ་པ་དེ་དག་གིས་ཀྱང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། ང་རྒྱལ་སྤྱོད་པ་དག་ཐེག་པ་གསུམ་པོ་དག་གིས་འདུལ་བར་བགྱིད་ལགས་མོད་ཀྱི། འོན་ཀྱང་དེ་དག་གིས་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཤས་ཆེ་བ་དང་།
en: Those worthy beings will, through the three yānas, train beings who have desire, anger, and pride.

source: རྩོད་པའི་དུས་ཀྱི་སྙིགས་མ་དག་ཡོངས་སུ་སྤངས་པས། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་མཚམས་མ་མཆིས་པ་བགྱིད་པ་རྣམས་དང་། དམ་པའི་ཆོས་སྤོང་བ་རྣམས་དང་། འཕགས་པ་ལ་སྐུར་བ་འདེབས་པ་རྣམས་དང་། ལོག་པར་ལྟ་བ་རྣམས་དང་། འཕགས་པའི་ནོར་བདུན་དང་བྲལ་བ་རྣམས་དང་། ཕར་མི་འཛིན་པ་རྣམས་དང་། མར་མི་འཛིན་པ་རྣམས་དང་། དགེ་སྦྱོང་དུ་མི་འཛིན་པ་རྣམས་དང་། བྲམ་ཟེར་མི་འཛིན་པ་རྣམས་དང་། བགྱི་བ་མ་ལགས་པ་བགྱིད་པ་རྣམས་དང་། བསོད་ནམས་མ་ལགས་པ་བགྱིད་པ་རྣམས་དང་།
en: However, they have avoided those who have the degeneracies of the kaliyuga when the obscuration of the kleśas is strong. “ ‘

source: འཇིག་རྟེན་ཕ་རོལ་ལ་འཇིགས་པར་མི་ལྟ་བ་རྣམས་དང་། ལེགས་པར་སྤྱོད་པ་གསུམ་པོ་དག་དོན་དུ་མི་གཉེར་བ་རྣམས་དང་། དེ་བཞིན་དུ་ལྷ་དང་། མི་རྣམས་ཀྱི་དཔལ་དང་། འབྱོར་པ་དག་ལ་བརྩོན་པ་རྣམས་ཉེས་པར་སྤྱོད་པ་གསུམ་པོ་དག་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་དང་།
en: Therefore, Bhadanta Bhagavat, they have abandoned those who have committed the actions with immediate results at death, those who have rejected the good Dharma, those who have maligned higher beings, those who have wrong views, those who do not have the seven noble jewels, those who do not respect their fathers, those who do not respect their mothers, those who do not respect monks, those who do not respect brahmins, those who do what should not be done, those who do that which is not meritorious, those who do not see the next world as frightening, those who are not interested in the three excellent types of conduct and therefore strive for the glory and wealth of devas and humans, those who are engaged in the three bad activities, those who are without the ten good courses of action, those who have been abandoned by all kalyāṇamitras, those who have been cast aside by all scholars, those who have entered the dungeon of existence, those who are swept away by the current, those who have sunk into hell’s caustic river, those who have sunk into the swamp of saṃsāra, those who are not free from the darkness of ignorance, those who have not rejected bad actions, those who are discarded within empty buddha realms, those who are accompanied by all bad roots, those who have been defeated by a bad path, and those beings who are in great despair. “ ‘

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་བྲལ་བ་རྣམས་དང་།
en: At that time, in the Bhadraka eon, in the Sahā buddha realm, humans will have a lifespan of ten years.

source: དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱིས་སྤངས་པ་རྣམས་དང་། མཁས་པ་ཐམས་ཅད་ཀྱིས་བོར་བ་རྣམས་དང་། སྲིད་པའི་བཙོན་རར་ཆུད་པ་རྣམས་དང་། རྒྱུན་ཕྱོགས་སུ་འདས་པ་རྣམས་དང་། འགྱུར་བྱེད་ཀྱི་ཆུ་ཀླུང་དུ་ནུབ་པ་རྣམས་དང་། འཁོར་བའི་འདམ་དུ་བྱིང་བ་རྣམས་དང་། གཏི་མུག་གི་མུན་པ་དང་མ་བྲལ་བ་རྣམས་དང་། མི་དགེ་བའི་བགྱི་བ་ཐམས་ཅད་མ་བཏང་བ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་ཐམས་ཅད་དུ་བོར་བ་རྣམས་དང་། མི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་འགྲོགས་པར་གྱུར་པ་རྣམས་དང་། ལམ་ངན་པས་བཅོམ་པར་གྱུར་པ་རྣམས་དང་། ཉམ་ང་བ་ཆེན་པོ་ཐོབ་པར་གྱུར་པ་རྣམས་སྤངས་ལགས་ཏེ། དེའི་ཚེ་ན་བསྐལ་པ་བཟང་པོ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་མིའི་ཚེ་ལོ་བཅུ་ཐུབ་པར་འགྱུར་བ་ཐམས་ཅད་སྐྱེས་བུ་དམ་པ་མཁས་པ་འདི་དག་གིས་སྤངས་ཤིང་བོར་བས་དེའི་ཚེ་སྲིད་པའི་དཔའ་གློང་དང་།
en: All of these humans have been cast aside and abandoned by wise, worthy beings.

source: འཁོར་བའི་འཁྲུལ་འཁོར་ན་སྐྱོབ་པ་མ་མཆིས་པ་དང་། སྐྱབས་མ་མཆིས་པ་དང་། དཔུང་གཉེན་མ་མཆིས་པ་དང་།
en: Therefore, at that time they have no savior, no refuge, and no resort in the whirlpool of existence and the wheel of saṃsāra.

source: སྡུག་བསྔལ་གྱི་སྣོད་དུ་གྱུར་པའི་སེམས་ཅན་དེ་དག་སྤངས་ནས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་བཟང་དགུ་ཡོངས་སུ་བཟུང་ཞིང་ཤིན་ཏུ་དུལ་བ་དང་། བསམ་པ་ཡོངས་སུ་དག་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྲུན་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་།
en: They have abandoned those beings who are containers of suffering, and they have chosen for themselves excellent buddha realms where they will have as disciples those who are well-trained, have pure motivations, have planted roots of virtue, are diligent, and have served many buddhas.

source: སངས་རྒྱས་མང་པོ་ལ་ལྷག་པར་བགྱི་བ་བགྱིས་པའི་འདུལ་བ་རྣམས་ཡོངས་སུ་བཟུང་བ་དེ་ལྟ་བུ་མ་ལགས་སམ།
en: Is that not so, Bhadanta Bhagavat?’ “ ‘

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བྲམ་ཟེ་དེ་བཞིན་ཏེ།
en: Brahmin, it is so,’ replied the Tathāgata Ratnagarbha. ‘

source: སེམས་ཅན་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྨོན་ལམ་འདེབས་པར་བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡང་ཡོངས་སུ་བཟུང་བ་རྣམས་ངས་ཀྱང་དེ་ཉིད་དུ་ལུང་བསྟན་ཏོ།
en: Beings make prayers according to their dispositions and they have chosen the arrays of qualities of their buddha realm, and I have prophesied them therein.’ “

source: །བྲམ་ཟེས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་དཔེར་ན་ཤིང་ཀང་ཀུ་ཤའི་འདབ་མ་བཞིན་དུ་སྙིང་འདར་ཞིང་བདག་གི་ཡིད་ནི་ཤིན་ཏུ་སྐྱོ་ལ་བདག་གི་ལུས་ཐམས་ཅད་ནི་ཤ་ཐང་བར་གྱུར་ཅིང་མཆིས་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སྤངས་ཤིང་རྩོད་པ་ཆེན་པོའི་དུས་ཀྱི་མུན་པར་འཕངས་ཏེ། ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྤངས་པའི་སེམས་ཅན་རྣམས་བདག་གི་སྙིང་རྗེའི་གནས་སུ་འགྱུར་བ་ལྟ་ན།
en: The brahmin said, ‘Bhadanta Bhagavat, my heart is shaking like the leaves of the Flame of the Forest tree, my mind is anguished, and my entire body becomes weary, if, Bhadanta Bhagavat, beings, who are the object of my compassion, were to be abandoned by bodhisattvas at that time, having been hurled into the darkness of the great kaliyuga, forsaken by all. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་བཟང་པོ་དེ་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་སྟོང་ཐུབ་པ་ན་སྡོད་ཅིང་བདག་ཡུན་རིང་པོ་དེ་སྲིད་དུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་འཁོར་བས་ཡོངས་སུ་མི་སྐྱོ་བར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, in the great Bhadraka eon, there will be a time when the lifespan of beings is a thousand years. Until then, may I not become disheartened by saṃsāra while performing bodhisattva conduct for a long time.

source: བདག་གིས་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་ཡུན་རིང་པོས་སྨིན་པར་བགྱི་འཚལ་བའི་འདུལ་བ་རྣམས་ཡོངས་སུ་འཛིན་པ་ལ་སྤྲོ་བར་བགྱི་ཞིང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ན་འདུལ་བ་རྣམས་ཡོངས་སུ་གཟུང་བར་བགྱི་སྟེ།
en: May I, through the power of samādhi, search out those who can be ripened for a long time and take care of those who can be trained. While practicing the six perfections, may I take care of those who can be trained. “ ‘

source: བདག་གིས་བཅོམ་ལྡན་འདས་ལས་དངོས་པོའི་མཚན་མ་ཡོངས་སུ་བཏང་བ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་སོ། །ཞེས་ཐོས་པས་བདག་གིས་དེ་ལྟ་བུའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱད་པར་བགྱི་སྟེ། ཇི་ལྟར་ཚེ་རབས་གཞན་དག་ན་སློངས་མོ་པའི་སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་པ་དག་མཆིས་པར་འགྱུར་ན་ཡང་དེ་དག་ལ་ཡོངས་སུ་གཏོང་བ་འདི་ལྟ་བུ་དག་ཡོངས་སུ་གཏོང་བར་གྱུར་ཅིག །འདི་ལྟ་སྟེ། ཟས་དང་། སྐོམ་དང་། བཟའ་བ་དང་། བཅའ་བ་དང་། བཏུང་བ་དང་། བལྡག་པ་དང་། གོས་དང་། མལ་ཆ་དང་། སྟན་དང་། གནས་དང་། མེ་ཏོག་ཕྲེང་དང་།
en: I have heard the Bhagavat say, “The perfection of generosity is to give up the characteristics of things.”

source: སྤོས་དང་། བྱུག་པ་དང་།
en: I will practice that kind of generosity.

source: ན་བའི་གསོས་སྨན་གྱི་སྦྱིན་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ནོར་དང་། འབྲུ་དང་། གླང་པོ་ཆེ་དང་། རྟ་དང་། ཤིང་རྟ་དང་། གསེར་དང་། དངུལ་དང་།
en: In my future lifetimes, when there are countless beings coming with requests, may I give away to them in this way: may I give them food and drink to eat, enjoy, drink, and lick, clothes, beds, seats, accommodations, garlands, incense, perfumes, medicine, parasols, victory banners, flags, wealth, grain, elephants, horses, chariots, gold, silver, cowries, jewels, pearls, beryl, conch, crystal, coral, silver artifacts, and gold artifacts.

source: འགྲོན་བུ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་།
en: May I give all kinds of gifts again and again.

source: བཻ་དཱུརྱ་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། རྡུལ་ཆེན་དང་། ས་ལེ་སྦྲམ་གྱི་སྦྱིན་པ་ཐམས་ཅད་ཡང་དང་ཡང་དུ་ཡོངས་སུ་གཏོང་བ་ན་བདག་ཀྱང་འདི་ལྟར་མཆོག་ཏུ་དགའ་ཞིང་སྙིང་རྗེའི་ཡིད་ཀྱིས་འབྲས་བུ་མི་འཚལ་བར་སེམས་ཅན་རྣམས་ལ་སྩལ་ནས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་དོན་དང་།
en: May I give to beings with perfect joy and a compassionate mind, without hoping to gain a result from my generosity.

source: འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པའི་སླད་དུ་བཏང་བའི་ཚོགས་རྣམས་ཡོངས་སུ་གཏོང་བར་གྱུར་ཅིག །གལ་ཏེ་ཡང་གཏང་བར་དཀའ་བ་སློང་བའི་སེམས་ཅན་དག་མཆིས་ནས་འདི་ལྟ་སྟེ། བྲན་དང་། བྲན་མོ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། རྒྱལ་སྲིད་དང་། མཆིས་བྲང་དང་།
en: May I give this mass of gifts in order to ripen beings and in order to nurture beings who can be trained. “ ‘

source: བུ་དང་། བུ་མོ་དང་། ལག་པ་ཡོངས་སུ་བཏང་བ་དང་། རྐང་པ་ཡོངས་སུ་བཏང་བ་དང་། རྣ་བ་དང་། སྣ་དང་། མིག་དང་། ལྕེ་དང་། པགས་པ་དང་།
en: When beings come who ask for the most difficult gifts, may I give away my male servants, my female servants, my villages, my towns, my kingdoms, my wife, my sons, my daughters, my hands, my feet, my ears, my nose, my eyes, my tongue, my skin, my blood, my bones, my body, my life, and my head to those who ask for those gifts.

source: ཁྲག་དང་། རུས་པ་དང་། ལུས་དང་། སྲོག་དང་། མགོ་ཡོངས་སུ་བཏང་བ་དེ་ལྟ་བུའི་ཡོངས་སུ་གཏོང་བ་དག་སློང་བར་བགྱིད་ན་ཡང་མཆོག་ཏུ་དགའ་ཞིང་སྙིང་རྗེའི་ཡིད་ཀྱིས་འབྲས་བུ་མི་འཚལ་བར་འདུལ་བ་རྣམས་ལ་ཕན་གདགས་པའི་སླད་དུ་སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་སྦྱིན་པར་གྱུར་ཅིག །
en: May I make these gifts to beings with perfect joy and a compassionate mind, without hoping to gain any result, in order to nurture those who can be trained.

source: བདག་གིས་འདི་ལྟ་བུའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་སྤྱད་པར་བགྱི་སྟེ། གང་སྔོན་ཆད་ནམ་ཡང་སེམས་ཅན་གང་གིས་ཀྱང་དེ་ལྟ་བུའི་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་བཏང་བར་མ་གྱུར་པ་དང་། སླན་ཆད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པ་གང་ཡང་དེ་ལྟ་བུའི་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་གཏོང་བར་མི་འགྱུར་བ་དེ་ལྟ་བུ་ཡོངས་སུ་གཏོང་བ་དག་ཡོངས་སུ་གཏོང་བར་གྱུར་ཅིག །
en: I will perform the perfection of generosity in such a way that never before has a being given away such gifts and ever after no bodhisattva would give away such gifts in their performance of bodhisattva conduct for attaining the highest, most complete enlightenment.

source: གང་དག་ཚེ་རབས་གཞན་ན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མ་མཆིས་པ་དེ་དང་དེ་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་གྱུར་ཅིག །
en: In those countless, innumerable lifetimes during hundreds of thousands of millions of trillions of eons, may I practice the perfection of generosity in my performance of bodhisattva conduct for attaining the highest, most complete enlightenment.

source: བདག་གིས་སླད་མའི་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་གང་ལགས་པ་རྣམས་ཀྱང་ཡོངས་སུ་གཏོང་བའི་ཚུལ་གྱི་ཡོན་ཏན་ལ་འགོད་པར་གྱུར་ཅིག །
en: May I establish subsequent bodhisattvas who have great compassion in the qualities of the way of generosity. “ ‘

source: ཉོན་མོངས་པའི་གཡུལ་རབ་ཏུ་ཞི་བ་གང་ལགས་པ་དེ་ནི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་ཏེ།
en: As you have previously said, “The perfection of discipline is to end the war of the kleśas.”

source: དེ་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པ་ན་རྟག་པར་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་སྣ་ཚོགས་ཀྱི་དཀའ་བ་སྤྱད་པ་སྤྱོད་པར་གྱུར་ཅིག །
en: In that way, in performing the bodhisattva conduct that leads to attaining the highest, most complete enlightenment, may I perform the arduous conduct of uninterrupted precepts and observances of various kinds. “ ‘

source: ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་ཡུལ་རྣམས་ལ་མི་བཟོད་པ་མ་མཆིས་པ་དང་། བདག་ལ་སོ་སོར་རྟོག་པའི་བར་གང་ལགས་པ་དེ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་ཏེ།
en: As you have previously said, “The perfection of patience is to observe oneself and not be impatient about anything.”

source: བདག་དེ་ལྟ་བུའི་བཟོད་པ་སྒོམ་པར་གྱུར་ཅིག །
en: May I cultivate patience in that way. “ ‘

source: ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་འདུས་བྱས་ཐམས་ཅད་དབེན་པ་ཉིད་དང་། འདུས་མ་བྱས་ཐམས་ཅད་ཞི་བར་སྒོམ་པ་ལ་བརྩོན་ཞིང་བླ་ན་མེད་པའི་སྤྱོད་པ་ལས་སླར་མི་ལྡོག་པ་གང་ལགས་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་སོ།
en: As you have previously said, “The perfection of diligence is to never regress from the supreme conduct of dedication to the meditation that is devoid of formations and the peace that is all that is unformed.” “ ‘

source: །འདུ་བྱེད་ཐམས་ཅད་ལ་ཕྱིན་ཅི་ལོག་སྤང་བའི་སླད་དུ་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་གང་ལགས་པ་དེ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་སོ།
en: As you have previously said, “The perfection of meditation is the practice of emptiness in order to eliminate being in error concerning all formations.” “ ‘

source: །རང་བཞིན་གྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་གང་ལགས་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་ཏེ།
en: The perfection of wisdom is forbearance that comes from the realization that phenomena are unborn.

source: གང་དག་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ཏུ་སྤྲོ་བ་བརྟན་པོའི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས་སྤྱོད་པ་ལ། ཇི་ལྟར་སྔན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པ་འགས་ཀྱང་དེ་ལྟར་སྤྲོ་བ་བརྟན་པོའི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མ་སྤྱད་ཅིང་།
en: You have described a bodhisattva’s conduct of the power, might, and strength of unwavering resolution throughout innumerable, countless hundreds of millions of trillions of eons, but there has been no bodhisattva, performing bodhisattva conduct for the sake of the highest, most complete buddhahood, who has practiced the perfection of wisdom with that power, might, and strength of unwavering resolution.

source: སླད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་སྤྱད་པ་སྤྱོད་པར་འགྱུར་བ་དག་ཀྱང་དེ་ལྟར་སྤྲོ་བ་བརྟན་པོའི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་མི་འགྱུར་བ་དེ་ལྟ་བུ་ལ་བདག་སྤྱོད་པར་གྱུར་ཅིག །
en: Nor in the future will there be a bodhisattva, performing bodhisattva conduct for the sake of the highest, most complete buddhahood, who will practice the perfection of wisdom with that power, might, and strength of unwavering resolution.

source: སླད་མའི་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་གང་ལགས་པ་རྣམས་ཀྱང་ཚུལ་གྱི་ཡོན་ཏན་ལ་འགོད་པར་གྱུར་ཅིག །
en: Therefore, may I do that and establish future bodhisattvas, who have great compassion, in the qualities of that way. “ ‘

source: བདག་གིས་སེམས་དང་པོ་བསྐྱེད་པས་ཀྱང་སླད་མའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་འགྲུབ་པར་གྱུར་ཅིག །
en: Through this first development of the aspiration for enlightenment, may I cause future bodhisattvas to accomplish great compassion.

source: བླ་ན་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངོ་མཚར་དུ་འཛིན་པར་བགྱི་བའི་སླད་དུ་བདག་སྦྱིན་པ་ལ་རློམ་སེམས་མ་མཆིས་པར་སྤྱོད་པར་གྱུར་ཅིག །
en: May I, in order to amaze bodhisattvas, practice generosity without being conceited, until my ultimate parinirvāṇa.

source: ཚུལ་ཁྲིམས་ལ་གནས་པ་མ་མཆིས་པ་དང་། བཟོད་པ་ལ་རློམ་སེམས་མ་མཆིས་པ་དང་། བརྩོན་འགྲུས་ལ་བླང་བ་མ་མཆིས་པ་དང་། བསམ་གཏན་རྣམས་ལ་གནས་པ་མ་མཆིས་པ་དང་། ཤེས་རབ་ལ་གཉིས་སུ་མ་མཆིས་པར་སྤྱོད་པར་གྱུར་ཅིག །
en: May I have good conduct without being dependent, patience without being conceited, diligence without making effort, meditation without being fixed, and wisdom without being dualistic.

source: སེམས་ཅན་འཕགས་པའི་ནོར་བདུན་དང་བྲལ་བ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་ཐམས་ཅད་དུ་བོར་བ་རྣམས་དང་། དམ་པའི་ཆོས་སྤོང་བ་རྣམས་དང་། འཕགས་པ་ལ་སྐུར་བ་འདེབས་པ་རྣམས་དང་། ལོག་པར་ལྟ་བ་རྣམས་དང་།
en: May I practice the perfections through the power, might, and strength of unwavering resolution, without desiring a result for myself, but for the sake of beings who do not have the seven riches of the noble ones, who have been discarded in all the empty buddha realms, who have rejected the good Dharma, who have maligned noble beings, who have wrong views, who are accompanied by all bad roots, who are in great despair, and who have been ruined by bad paths. “ ‘
